Project/Toir.Adaptation/src/Reports/гкс_ОтчетПоПросрочкеСогласования/гкс_ОтчетПоПросрочкеСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>гкс_ОтчетПоПросрочкеСогласования</name>
</mdclass:Report>

Project/Toir.Adaptation/src/InformationRegisters/торо_ИсторияСтатусовСогласованияДокументов/торо_ИсторияСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИсторияСтатусовСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ЗаКого</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="64bc746f-49d7-4ab4-84dd-3377fcefa0f7">
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Ремонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГарантийныйРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c78bcaa2-754f-4a7f-9e89-f5a6e42d7594">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОтмененныеРемонты/торо_ОтмененныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ОтмененныеРемонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="b7320fcb-d548-4601-9a7c-f8afd914b08c">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/торо_СпособыСогласованияДокументов/торо_СпособыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СпособыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="02bc949c-5e4c-4b15-83c1-a8495643e26c">
    <name>ПорядокСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="69807f2d-19a0-4039-9d55-8a6629b3ee9a">
      <name>гкс_ПроводитьАвтоматически</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e3f7b11a-33d2-425a-b6b6-a3b9d3451f37">
      <name>ПроведениеДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="304f1d2e-c348-4b56-9d54-9d830aeb8100">
      <name>ТекущийСтатус</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13294823-5282-48a7-ae3c-3980d87974ff">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Reports/гкс_ОтчетПоПросрочкеСогласования/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакета = новый КомпоновщикМакетаКомпоновкиДанных();
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	//
	ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	ПараметрТип = Новый ПараметрКомпоновкиДанных("ТипДокумента");
	ДопПараметры = Новый Структура("ДатаНачала,ДатаОкончания", Дата(1, 1, 1), Дата(3999, 1, 1));
	Для Каждого СМ Из Настройки.ПараметрыДанных.Элементы Цикл
		Если СМ.Использование = Истина Тогда 
			Если СМ.Параметр = ПараметрПериод Тогда
				ДопПараметры.ДатаНачала = СМ.Значение.ДатаНачала;
				ДопПараметры.ДатаОкончания = СМ.Значение.ДатаОкончания;
			КонецЕсли;
	#Область СписокТипов
			Если СМ.Параметр = ПараметрТип Тогда
				МассивТипов = Новый Массив();
				Для Каждого КлючЗначение Из СМ.Значение Цикл
					Если КлючЗначение.Значение = "Смета ремонта (Заявка на ремонт)" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
					ИначеЕсли КлючЗначение.Значение = "Акт о выполнении этапа работ" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот"));
					ИначеЕсли КлючЗначение.Значение = "Выявленные дефекты" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
					ИначеЕсли КлючЗначение.Значение = "Внешнее основание для работ" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
					ИначеЕсли КлючЗначение.Значение = "Наряд на выполнение ремонтных работ" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот"));
					ИначеЕсли КлючЗначение.Значение = "Акт о выполнении регламентного мероприятия" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия"));
					ИначеЕсли КлючЗначение.Значение = "Акт приемки оборудования" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_АктПриемкиОборудования"));
					ИначеЕсли КлючЗначение.Значение = "Наряд на регламентное мероприятие" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие"));
					ИначеЕсли КлючЗначение.Значение = "План-график ППР" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_ПланГрафикРемонта"));
					ИначеЕсли КлючЗначение.Значение = "План работ" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_ПланРаботПодразделения"));
					ИначеЕсли КлючЗначение.Значение = "EWO-бланк" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.гкс_ЕВОБланк"));
					ИначеЕсли КлючЗначение.Значение = "Остановочные ремонты" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_ОстановочныеРемонты"));
					ИначеЕсли КлючЗначение.Значение = "График регламентных мероприятий" Тогда 
						МассивТипов.Добавить(Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР"));
					КонецЕсли;
				КонецЦикла;
				ДопПараметры.Вставить("ТипДокумента", МассивТипов);
			КонецЕсли;
	#КонецОбласти
		КонецЕсли;
	КонецЦикла;
	//
	ВнешниеНаборыДанных = Новый Структура();
	ВнешниеНаборыДанных.Вставить("ВТ_Данные", ПолучитьТаблицуДанных(ДопПараметры));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКД.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКД);
КонецПроцедуры

Функция ПолучитьТаблицуДанных(ДопПараметры)
	#Область ПодготовкаТаблицы
	Таблица = Новый ТаблицаЗначений();
	ТипСсылка = Метаданные.ОпределяемыеТипы.торо_СогласуемыеДокументы.Тип;
	ТипСпособ = Новый ОписаниеТипов("СправочникСсылка.торо_СпособыСогласованияДокументов");
	ТипСтатус = Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот");
	ТипСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ТипСтрока500 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(500));
	ТипЧисло10 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10));
	ТипДата = Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ТипБулево = Новый ОписаниеТипов("Булево");
	Таблица.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Ссылка", ТипСсылка);
	Таблица.Колонки.Добавить("СпособСогласования", ТипСпособ);
	Таблица.Колонки.Добавить("ТекущийСтатус", ТипСтатус);
	Таблица.Колонки.Добавить("ДатаСогласования", ТипДата);
	Таблица.Колонки.Добавить("ДатаСогласованияНовая", ТипДата);
	Таблица.Колонки.Добавить("Срок", ТипЧисло10);
	Таблица.Колонки.Добавить("СрокЗадержки", ТипЧисло10);
	Таблица.Колонки.Добавить("СтатусНовый", ТипСтрока150);
	Таблица.Колонки.Добавить("Согласующий", ТипСтрока500);
	Таблица.Колонки.Добавить("Замещающий", ТипСтрока500);
	Таблица.Колонки.Добавить("ЭтоТекущий", ТипБулево);
	#КонецОбласти
	Запрос = Новый Запрос();
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	История.СогласуемыйДокумент КАК Документ,
		|	История.СтатусДокумента КАК Статус,
		|	&СпособТекст КАК Способ,
		|	История.Период КАК ДатаСтатуса
		|ПОМЕСТИТЬ ВсяИсторияСтатусы0
		|ИЗ
		|	РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов КАК История
		|			
		| Где			История.СогласуемыйДокумент.Дата < &ДатаОкончания
		|				И История.СогласуемыйДокумент.Дата >= &ДатаНачала
		|				И История.СогласуемыйДокумент.ПометкаУдаления = ЛОЖЬ 
		| " ;
	Если ДопПараметры.Свойство("ТипДокумента") Тогда 
		Запрос.Текст = Запрос.Текст + " И ТипЗначения(История.СогласуемыйДокумент) В (&ТипДокумента)";
		Запрос.УстановитьПараметр("ТипДокумента", ДопПараметры.ТипДокумента);
	КонецЕсли;
Запрос.Текст = Запрос.Текст 
+ "
		| " 
		+ " ; " + "
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	История.Документ КАК Документ,
		|	История.Статус КАК Статус,
		|	История.Способ КАК Способ,
		|	ДОБАВИТЬКДАТЕ(История.ДатаСтатуса, ДЕНЬ, РегистрСведенийгкс_СрокиСогласования.Срок) КАК ДатаОкончания,
		|	РегистрСведенийгкс_СрокиСогласования.Срок КАК Срок,
		|	История.ДатаСтатуса КАК ДатаСтатуса
		|ПОМЕСТИТЬ ВсяИсторияСтатусы
		|ИЗ
		|	ВсяИсторияСтатусы0 КАК История
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СрокиСогласования КАК РегистрСведенийгкс_СрокиСогласования
		|		ПО История.Способ = РегистрСведенийгкс_СрокиСогласования.Способ
		|			И История.Статус = РегистрСведенийгкс_СрокиСогласования.Статус  И РегистрСведенийгкс_СрокиСогласования.Срок > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсяИсторияСтатусы.Документ КАК Документ,
		|	ВсяИсторияСтатусы.ДатаСтатуса КАК ДатаСтатуса,
		|	ВсяИсторияСтатусы.ДатаОкончания КАК ДатаОкончания,
		|	МИНИМУМ(Следующий.ДатаСтатуса) КАК ДатаСтатусаНовый,
		|	ВсяИсторияСтатусы.Статус КАК Статус,
		|	ВсяИсторияСтатусы.Способ КАК Способ,
		|	ВсяИсторияСтатусы.Срок КАК Срок
		|ПОМЕСТИТЬ СрезСледующихСтатусов
		|ИЗ
		|	ВсяИсторияСтатусы КАК ВсяИсторияСтатусы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсяИсторияСтатусы0 КАК Следующий
		|		ПО ВсяИсторияСтатусы.Документ = Следующий.Документ
		|			И ВсяИсторияСтатусы.ДатаСтатуса < Следующий.ДатаСтатуса
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсяИсторияСтатусы.Документ,
		|	ВсяИсторияСтатусы.ДатаСтатуса,
		|	ВсяИсторияСтатусы.ДатаОкончания,
		|	ВсяИсторияСтатусы.Статус,
		|	ВсяИсторияСтатусы.Способ,
		|	ВсяИсторияСтатусы.Срок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсяИсторияСтатусы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СрезСледующихСтатусов.Документ КАК Документ,
		|	СрезСледующихСтатусов.ДатаСтатуса КАК ДатаСтатуса,
		|	СрезСледующихСтатусов.Статус КАК Статус,
		|	СрезСледующихСтатусов.Способ КАК Способ,
		|	ВсяИсторияСтатусы.Статус КАК СтатусНовый,
		|	ЕСТЬNULL(ВсяИсторияСтатусы.ДатаСтатуса, &ТекущаяДата) КАК ДатаСтатусаНовый,
		|	ВсяИсторияСтатусы.ДатаСтатуса ЕСТЬ NULL КАК ЭтоТекущий,
		|	СрезСледующихСтатусов.Срок КАК Срок,
		|	СрезСледующихСтатусов.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВсеСтатусы
		|ИЗ
		|	СрезСледующихСтатусов КАК СрезСледующихСтатусов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсяИсторияСтатусы0 КАК ВсяИсторияСтатусы
		|		ПО СрезСледующихСтатусов.Документ = ВсяИсторияСтатусы.Документ
		|			И СрезСледующихСтатусов.ДатаСтатусаНовый = ВсяИсторияСтатусы.ДатаСтатуса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсяИсторияСтатусы0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СрезСледующихСтатусов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_РемонтыСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Отмененные
		|ИЗ
		|	РегистрСведений.торо_Ремонты.СрезПоследних(
		|			,
		|			Регистратор В
		|				(ВЫБРАТЬ
		|					ТЧ.Документ
		|				ИЗ
		|					ВсеСтатусы КАК ТЧ)) КАК торо_РемонтыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних КАК торо_ОтмененныеРемонтыСрезПоследних
		|		ПО торо_РемонтыСрезПоследних.ID = торо_ОтмененныеРемонтыСрезПоследних.ID
		|			И (торо_ОтмененныеРемонтыСрезПоследних.Отменен = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеСтатусы.Документ КАК Документ,
		|	ВсеСтатусы.ДатаСтатуса КАК ДатаСтатуса,
		|	ВсеСтатусы.Статус КАК Статус,
		|	ВсеСтатусы.Способ КАК Способ,
		|	ВсеСтатусы.СтатусНовый КАК СтатусНовый,
		|	ВсеСтатусы.ДатаСтатусаНовый КАК ДатаСтатусаНовый,
		|	ВсеСтатусы.ЭтоТекущий КАК ЭтоТекущий,
		|	ВсеСтатусы.Срок КАК Срок,
		|	ВсеСтатусы.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВсеСтатусы КАК ВсеСтатусы
		|ГДЕ
		|	ВсеСтатусы.ДатаСтатусаНовый > ВсеСтатусы.ДатаОкончания
		|ИТОГИ
		|	МАКСИМУМ(Способ)
		|ПО
		|	Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеСтатусы.Способ КАК Способ,
		|	ВсеСтатусы.СтатусНовый КАК Статус,
		|	торо_СпособыСогласованияДокументовПорядокСогласования.Пользователь КАК Пользователь,
		|	ЛОЖЬ КАК ЭтоТекущий
		|ИЗ
		|	ВсеСтатусы КАК ВсеСтатусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_СпособыСогласованияДокументов.ПорядокСогласования КАК торо_СпособыСогласованияДокументовПорядокСогласования
		|		ПО ВсеСтатусы.Способ = торо_СпособыСогласованияДокументовПорядокСогласования.Ссылка
		|			И (НЕ ВсеСтатусы.ЭтоТекущий)
		|			И ВсеСтатусы.СтатусНовый = торо_СпособыСогласованияДокументовПорядокСогласования.ТекущийСтатус
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеСтатусы.Способ,
		|	ВсеСтатусы.Статус,
		|	торо_СпособыСогласованияДокументовПорядокСогласования.Пользователь,
		|	ИСТИНА
		|ИЗ
		|	ВсеСтатусы КАК ВсеСтатусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_СпособыСогласованияДокументов.ПорядокСогласования КАК торо_СпособыСогласованияДокументовПорядокСогласования
		|			ПО торо_МатрицаПереходаСтатусовДокументов.СпособСогласования = торо_СпособыСогласованияДокументовПорядокСогласования.Ссылка
		|				И торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус = торо_СпособыСогласованияДокументовПорядокСогласования.ТекущийСтатус
		|		ПО (ВсеСтатусы.ЭтоТекущий)
		|			И ВсеСтатусы.Статус = торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус
		|			И ВсеСтатусы.Способ = торо_МатрицаПереходаСтатусовДокументов.СпособСогласования
		|ИТОГИ ПО
		|	Способ,
		|	Статус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеСтатусы.Способ КАК Способ,
		|	ВсеСтатусы.СтатусНовый КАК Статус,
		|	торо_СпособыСогласованияДокументовПорядокСогласования.Замещающий КАК Пользователь,
		|	ЛОЖЬ КАК ЭтоТекущий
		|ИЗ
		|	ВсеСтатусы КАК ВсеСтатусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_СпособыСогласованияДокументов.Замещающие КАК торо_СпособыСогласованияДокументовПорядокСогласования
		|		ПО ВсеСтатусы.Способ = торо_СпособыСогласованияДокументовПорядокСогласования.Ссылка
		|			И (НЕ ВсеСтатусы.ЭтоТекущий)
		|			И ВсеСтатусы.СтатусНовый = торо_СпособыСогласованияДокументовПорядокСогласования.ТекущийСтатус
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеСтатусы.Способ,
		|	ВсеСтатусы.Статус,
		|	торо_СпособыСогласованияДокументовПорядокСогласования.Замещающий,
		|	ИСТИНА
		|ИЗ
		|	ВсеСтатусы КАК ВсеСтатусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_СпособыСогласованияДокументов.Замещающие КАК торо_СпособыСогласованияДокументовПорядокСогласования
		|			ПО торо_МатрицаПереходаСтатусовДокументов.СпособСогласования = торо_СпособыСогласованияДокументовПорядокСогласования.Ссылка
		|				И торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус = торо_СпособыСогласованияДокументовПорядокСогласования.ТекущийСтатус
		|		ПО (ВсеСтатусы.ЭтоТекущий)
		|			И ВсеСтатусы.Статус = торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус
		|			И ВсеСтатусы.Способ = торо_МатрицаПереходаСтатусовДокументов.СпособСогласования
		|ИТОГИ ПО
		|	Способ,
		|	Статус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеСтатусы.Способ КАК Способ,
		|	ВсеСтатусы.Статус КАК Статус,
		|	торо_МатрицаПереходаСтатусовДокументов.СледующийСтатус КАК СтатусНовый
		|ИЗ
		|	ВсеСтатусы КАК ВсеСтатусы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
		|		ПО ВсеСтатусы.Статус = торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус
		|			И ВсеСтатусы.Способ = торо_МатрицаПереходаСтатусовДокументов.СпособСогласования
		|ИТОГИ ПО
		|	Способ,
		|	Статус";
	//
	ТекстПоляСпособ = "ВЫБОР ";
	МассивТиповТекст = Новый Массив();
	Для Каждого СтрокаМассива Из Метаданные.ОпределяемыеТипы.торо_СогласуемыеДокументы.Тип.Типы() Цикл
		ОбъектТипа = Метаданные.НайтиПоТипу(СтрокаМассива);
		Если Метаданные.Документы.Содержит(ОбъектТипа) = Истина Тогда 
			МассивТиповТекст.Добавить("КОГДА История.СогласуемыйДокумент
			|	Ссылка Документ." + ОбъектТипа.Имя + " 
			|	Тогда Выразить(История.СогласуемыйДокумент 
			|	КАК Документ." + ОбъектТипа.Имя + " ).СпособСогласования
			|");
		КонецЕсли;
	КонецЦикла;
	ТекстПоляСпособ = ТекстПоляСпособ + СтрСоединить(МассивТиповТекст, " ") + " ИНАЧЕ null КОНЕЦ ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СпособТекст", ТекстПоляСпособ);
	ТекДата = ТекущаяДата();
	КоличествоПакетовРавное1 = 1;
	ПакетОснова = 8;
	ПакетСогласующие = ПакетОснова + КоличествоПакетовРавное1;
	ПакетЗамещающие = ПакетСогласующие + КоличествоПакетовРавное1;
	ПакетСтатус = ПакетЗамещающие + КоличествоПакетовРавное1;
	#КонецОбласти
	Запрос.УстановитьПараметр("ДатаНачала", ДопПараметры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДопПараметры.ДатаОкончания);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДок = РезультатЗапроса[ПакетОснова].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСогласующие = РезультатЗапроса[ПакетСогласующие].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаЗамещающие = РезультатЗапроса[ПакетЗамещающие].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСледующие = РезультатЗапроса[ПакетСтатус].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДок.Следующий() Цикл
		ВыборкаСогласующие.Сбросить();
		Если ВыборкаСогласующие.НайтиСледующий(Новый Структура("Способ", ВыборкаДок.Способ)) Тогда 
			ВыборкаСоглСтатус = ВыборкаСогласующие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Иначе
			ВыборкаСоглСтатус = Неопределено;
		КонецЕсли;
		ВыборкаЗамещающие.Сбросить();
		Если ВыборкаЗамещающие.НайтиСледующий(Новый Структура("Способ", ВыборкаДок.Способ)) Тогда 
			ВыборкаЗамСтатус = ВыборкаЗамещающие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Иначе
			ВыборкаЗамСтатус = Неопределено;
		КонецЕсли;
		ВыборкаСледующие.Сбросить();
		Если ВыборкаСледующие.НайтиСледующий(Новый Структура("Способ", ВыборкаДок.Способ)) Тогда 
			ВыборкаСледСтатус = ВыборкаСледующие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Иначе
			ВыборкаСледСтатус = Неопределено;
		КонецЕсли;
		//
		ВыборкаСтатус = ВыборкаДок.Выбрать();
		Пока ВыборкаСтатус.Следующий() Цикл
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.Ссылка = ВыборкаДок.Документ;
			НоваяСтрока.ТипДокумента = ТипЗнч(ВыборкаДок.Документ);
			НоваяСтрока.СпособСогласования = ВыборкаСтатус.Способ;
			НоваяСтрока.ТекущийСтатус = ВыборкаСтатус.Статус;
			НоваяСтрока.ДатаСогласования = ВыборкаСтатус.ДатаСтатуса;
			НоваяСтрока.ЭтоТекущий = ВыборкаСтатус.ЭтоТекущий;
			Если ВыборкаСтатус.ЭтоТекущий Тогда 
				НоваяСтрока.ДатаСогласованияНовая = Дата(1, 1, 1); //ВыборкаСтатус.ДатаОкончания;
				Если Не ВыборкаСледСтатус = Неопределено Тогда 
					ВыборкаСледСтатус.Сбросить();
					СтруктПоиска = Новый Структура("Статус", ВыборкаСтатус.Статус);
					МассивТекста = Новый Массив();
					Если ВыборкаСледСтатус.НайтиСледующий(СтруктПоиска) Тогда 
						Выборка = ВыборкаСледСтатус.Выбрать();
						Пока Выборка.Следующий() Цикл
							МассивТекста.Добавить(Строка(Выборка.СтатусНовый));
						КонецЦикла;
					КонецЕсли;
					НоваяСтрока.СтатусНовый = СтрСоединить(МассивТекста, ", ");;
				КонецЕсли;
			Иначе
				НоваяСтрока.ДатаСогласованияНовая = ВыборкаСтатус.ДатаСтатусаНовый;
				НоваяСтрока.СтатусНовый = Строка(ВыборкаСтатус.СтатусНовый);
			КонецЕсли;
			НоваяСтрока.Срок = ВыборкаСтатус.Срок;
			НоваяСтрока.СрокЗадержки = Цел((ВыборкаСтатус.ДатаСтатусаНовый - ВыборкаСтатус.ДатаСтатуса) / 86400);
			//
			Если Не ВыборкаСоглСтатус = Неопределено Тогда 
				ВыборкаСоглСтатус.Сбросить();
				Если ВыборкаСтатус.ЭтоТекущий Тогда 
					СтруктПоиска = Новый Структура("Статус", ВыборкаСтатус.Статус);
				Иначе
					СтруктПоиска = Новый Структура("Статус", ВыборкаСтатус.СтатусНовый);
				КонецЕсли;
				МассивТекста = Новый Массив();
				Если ВыборкаСоглСтатус.НайтиСледующий(СтруктПоиска) Тогда 
					Выборка = ВыборкаСоглСтатус.Выбрать();
					Пока Выборка.Следующий() Цикл
						Если Выборка.ЭтоТекущий = ВыборкаСтатус.ЭтоТекущий Тогда 
							МассивТекста.Добавить(Строка(Выборка.Пользователь));
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				НоваяСтрока.Согласующий = СтрСоединить(МассивТекста, ", ");;
			КонецЕсли;
			//
			Если Не ВыборкаЗамСтатус = Неопределено Тогда 
				ВыборкаЗамСтатус.Сбросить();
				Если ВыборкаСтатус.ЭтоТекущий Тогда 
					СтруктПоиска = Новый Структура("Статус", ВыборкаСтатус.Статус);
				Иначе
					СтруктПоиска = Новый Структура("Статус", ВыборкаСтатус.СтатусНовый);
				КонецЕсли;
				МассивТекста = Новый Массив();
				Если ВыборкаЗамСтатус.НайтиСледующий(СтруктПоиска) Тогда 
					Выборка = ВыборкаЗамСтатус.Выбрать();
					Пока Выборка.Следующий() Цикл
						Если Выборка.ЭтоТекущий = ВыборкаСтатус.ЭтоТекущий Тогда 
							МассивТекста.Добавить(Строка(Выборка.Пользователь));
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				НоваяСтрока.Замещающий = СтрСоединить(МассивТекста, ", ");;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Таблица;
КонецФункции
